<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Copied from soon-to-be-deprecated https://github.com/autopkg/chalcahuite-recipes/blob/master/Solstice/Solstice.munki.recipe</string>
	<key>Description</key>
	<string>Downloads the latest version of Solstice and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.eshirk.munki.Solstice</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>SolsticeClientMacWeb</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Solstice</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Easily share and control any amount of content from laptops and mobile devices to the meeting room display. Wirelessly stream device screens, app windows, HD videos and more – whatever it takes to drive consensus and get the job done.</string>
			<key>developer</key>
			<string>Mersive Technologies</string>
			<key>display_name</key>
			<string>Solstice</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mlbz521.download.Solstice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
